In [2]:
import numpy as np
import pandas as pd
s1 = pd.Series(np.random.randint(1,101,9),
          index=[['a','a','a','b','b','c','c','d','d'],
                      [1,2,3,1,2,3,1,2,3]])
s1

a  1    30
   2    58
   3    71
b  1    87
   2    92
c  3    94
   1    44
d  2    49
   3     8
dtype: int64

In [3]:
s1['a']

1    30
2    58
3    71
dtype: int64

In [4]:
s1.unstack()

      1     2     3
a  30.0  58.0  71.0
b  87.0  92.0   NaN
c  44.0   NaN  94.0
d   NaN  49.0   8.0

In [6]:
import numpy as np
import pandas as pd
s1 = pd.Series(np.random.randint(1,101,9),
          index=[['a','a','a','b','b','c','c','d','d'],
                      [1,2,3,1,2,3,1,2,3]])
s1.index.names=['x','y']

In [14]:
s2 = s1.unstack(level='y')
s2

y     1     2     3
x
a  11.0  46.0  15.0
b  22.0  61.0   NaN
c  78.0   NaN  21.0
d   NaN  21.0  40.0

In [16]:
s3 = s2.stack()
s3

x  y
a  1    11.0
   2    46.0
   3    15.0
b  1    22.0
   2    61.0
c  1    78.0
   3    21.0
d  2    21.0
   3    40.0
dtype: float64

In [22]:
s3.swaplevel().sort_index(level='x')

y  x
1  a    11.0
2  a    46.0
3  a    15.0
1  b    22.0
2  b    61.0
1  c    78.0
3  c    21.0
2  d    21.0
3  d    40.0
dtype: float64

In [27]:
df1 = pd.DataFrame(np.arange(12).reshape(4,3),
                   index=[['a','a','b','b'],[1, 2, 1, 2]],
                   columns=[['台北','台北','台中'],['Green','Red','Green']])
df1

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [29]:
df1.index.names = ['key1','key2']
df1.columns.names =['縣市','顏色']
df1

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [30]:
df1.swaplevel('key1','key2')

縣市           台北        台中
顏色        Green Red Green
key2 key1
1    a        0   1     2
2    a        3   4     5
1    b        6   7     8
2    b        9  10    11

In [32]:
df2 = df1.stack(level='縣市')
df2

/tmp/ipykernel_2537/296858586.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df2 = df1.stack(level='縣市')

顏色            Green   Red
key1 key2 縣市
a    1    台中      2   NaN
          台北      0   1.0
     2    台中      5   NaN
          台北      3   4.0
b    1    台中      8   NaN
          台北      6   7.0
     2    台中     11   NaN
          台北      9  10.0

In [33]:
df2.unstack('key1')

顏色      Green      Red
key1        a   b    a     b
key2 縣市
1    台中     2   8  NaN   NaN
     台北     0   6  1.0   7.0
2    台中     5  11  NaN   NaN
     台北     3   9  4.0  10.0